1. По заданию папка фикстур расположена common/fixtures. Это удобно, как делают обычно на практике?
2. По умолчанию в шаблоне создаются стили от контроллера по умолчанию, стили повлияли на шрифт и некоторые классы верстки.
3. Как переназначить контроллер по умолчанию и контролировать загрузку нужных стилей. 
4. Как работают альясы @app/views/layouts/main.php
5. $form = ActiveForm::begin() ... echo $form->field($taskForm, 'search') по умолчанию создаются новые стили и новые теги 
6. $_POST в классах не работают, вместо него метод yii->$app->request()


Семантическое Версионирование 2.0.0 https://semver.org/lang/ru/
https://proglib.io/